Revit 2027 API
AlignmentStationLabelSetOptions.EndStation Property
 The ending station for creating labels in the set, in Revit internal model units (standard Imperial feet). The default value is null. When null, the station value corresponding to the alignment's DisplayedEndStation is used.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double? EndStation { get; set; }
Public Property EndStation As Double?
	Get
	Set
public:
property Nullable<double> EndStation {
	Nullable<double> get ();
	void set (Nullable<double> value);
}
member EndStation : Nullable<float> with get, set
Property Value
Nullable<Double>
See Also
Reference
AlignmentStationLabelSetOptions Class
Autodesk.Revit.DB.Infrastructure Namespace